{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "batch_input_shape": [null, 3, 50, 50], "dtype": "float32", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "name": "conv2d_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_4", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_5", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_6", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_7", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_first", "name": "conv2d_8", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 16, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "units": 50, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "units": 2, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null}}], "keras_version": "2.0.2"}